Revit 2026 API

# CameraUpDirection Property

---

Up direction of the camera

**Namespace:** Autodesk.Revit.DB.DirectContext3D**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public XYZ UpDirection { get; set; }
```
```vb
Public Property UpDirection As XYZ
	Get
	Set
```
```cpp
public:
property XYZ^ UpDirection {
	XYZ^ get ();
	void set (XYZ^ value);
}
```
```fsharp
member UpDirection : XYZ with get, set
```

#### Property Value

XYZ

| Exception | Condition |
| --- | --- |
| ArgumentNullException | When setting this property: A non-optional argument was null |

#### Reference

Camera Class

Autodesk.Revit.DB.DirectContext3D Namespace